USE ThreeKingdom;

INSERT INTO s_items (id, name, description) VALUES 
(1, 'Gold', 'Currency'),
(2, 'Wood', 'Building material'),
(3, 'Stone', 'Building material'),
(4, 'Food', 'Sustenance'),
(5, 'Population', 'People');

truncate table s_buildings;
insert into s_buildings (`id`, `name`, `level`,`width`, `height`, `cost_item`,
 `cost_num`, `cost_item2`, `cost_num2`, `cost_item3`, `cost_num3`, `build_sec`, 
 `destroy_sec`, `is_sub_building`, `limit_num`)
values 
('3','伐木场',  1, 3,2, 1, 10, 2, 10, 3, 10, 10, 10, 0, 0),
('4','采石场',  1, 3,2, 1, 10, 2, 10, 3, 10, 10, 10, 0, 0),
('5','粮仓',    1, 3,2, 1, 10, 2, 10, 3, 10, 10, 10, 0, 0),
('6','兵营',    1, 3,2, 1, 10, 2, 10, 3, 10, 10, 10, 0, 0),
('7','马厩',    1, 3,2, 1, 10, 2, 10, 3, 10, 10, 10, 0, 0),
('9','官府',    1, 7,4, 1, 10, 2, 10, 3, 10, 10, 10, 0, 1),

-- rect子建筑
('101','农田',    1, 1,1, 1, 10, 2, 10, 3, 10, 10, 10, 1, 0),

-- rect子建筑
('201','木质城墙', 1, 1, 1, 1, 10, 2, 10, 3, 10, 10, 10, 1, 0), 
('202','石头城墙',    1, 2,2, 1, 10, 2, 10, 3, 10, 10, 10, 1, 0),

-- rect子建筑
('301','道路',    1, 1,1, 1, 10, 2, 10, 3, 10, 10, 10, 1, 0), 

-- rect子建筑
('401','房子2X2',    1, 2,2, 1, 10, 2, 10, 3, 10, 10, 10, 1, 0), 
('402','房子3X2',    1, 3,2, 1, 10, 2, 10, 3, 10, 10, 10, 1, 0),
('403','房子4X4',    1, 4, 4, 1, 10, 2, 10, 3, 10, 10, 10, 1, 0),
('404','房子5X4',    1, 4, 4, 1, 10, 2, 10, 3, 10, 10, 10, 1, 0)
;

-- 房屋人口上限
truncate table s_house_population;
insert into s_house_population (`type`, `level`, `population`) 
values 
(401, 1, 10),
(402, 1, 20),
(403, 1, 30),
(404, 1, 40),
(9,1,100);

-- height 和  width  本来是 N倍的TILE_SIZE 但是现在希望一个TILE_SIZE放置更多建筑
-- height 和  width  各自 /2 == N
truncate table s_rect_building;
insert into s_rect_building (`type`, `name`, `width`, `height`, `sub_buildings`, `sub_max_num`)
values 
(1, '农田', 2, 2, 101, 1),
(2, '道路', 2, 2, 301, 1),
(3, '木质城墙', 2, 2, 201, 1),
(3, '石头城墙', 4, 4, 202, 1),

(4, '高密度 房子2X2', 3, 3, 401, 18),
(4, '高密度 房子3X2', 4, 3, 402, 9),
(5, '低密度 房子4X4', 5, 4, 403, 2),
(5, '低密度 房子5X4', 5, 5, 404, 2)
;

-- 从0岁开始 升级到1岁 读0岁的时间 升级到18岁读17岁的时间 因为升级到19读18 又18对应0 所以直接成年
TRUNCATE TABLE s_person_age;
INSERT INTO s_person_age (id, duration) VALUES
(0, 60),
(1, 60),
(2, 60),
(3, 60),
(4, 60),
(5, 60),
(6, 60),
(7, 60),
(8, 60),
(9, 60),
(10, 60),
(11, 60),
(12, 60),
(13, 60),
(14, 60),
(15, 60),
(16, 60),
(17, 60),
(18, 0);

-- 每个年龄段对属性的加成 如果没有这个年龄段的加成 默认取年龄1的加成
TRUNCATE TABLE s_person_character_attr;
INSERT INTO s_person_character_attr 
(`type`, `type_name`, `level`, `attr_val1`, `attr_val2`, `attr_val3`, `attr_val4`, `attr_val5`, `attr_val6`, `attr_val7`, `attr_val8`, `attr_val9`, `attr_val10`, `attr_val11`, `attr_val12`) VALUES
--              年龄  武力 智力 统帅 政治  魅力 运气  忠诚  耐心 体力   速度  生命值   恢复速度
(1, "平平无奇",  1,   1,   1,   1,   1,   1,   1,   1,    1,   1,    1,    100,     1),
(1, "平平无奇",  2,   1,   1,   1,   1,   1,   1,   1,    1,   1,    1,    0,       0),
(1, "平平无奇",  3,   1,   1,   1,   1,   1,   1,   1,    1,   1,    1,    0,       0),
(1, "平平无奇",  4,   1,   1,   1,   1,   1,   1,   1,    1,   1,    1,    0,       0),
(1, "平平无奇",  5,   1,   1,   1,   1,   1,   1,   1,    1,   1,    1,    0,       0),
(1, "平平无奇",  6,   1,   1,   1,   1,   1,   1,   1,    1,   1,    1,    0,       0),
(1, "平平无奇",  7,   1,   1,   1,   1,   1,   1,   1,    1,   1,    1,    0,       0),
(1, "平平无奇",  8,   1,   1,   1,   1,   1,   1,   1,    1,   1,    1,    0,       0),
(1, "平平无奇",  9,   1,   1,   1,   1,   1,   1,   1,    1,   1,    1,    0,       0),
(1, "平平无奇",  10,  1,   1,   1,   1,   1,   1,   1,    1,   1,    1,    20,      0),
(1, "平平无奇",  11,  1,   1,   1,   1,   1,   1,   10,   1,   1,    0,    20,      0),
(1, "平平无奇",  12,  1,   1,   1,   1,   1,   1,   10,   1,   1,    0,    20,      0),
(1, "平平无奇",  13,  1,   1,   1,   1,   1,   1,   10,   1,   1,    0,    20,      0),
(1, "平平无奇",  14,  1,   1,   1,   1,   1,   1,   10,   1,   1,    0,    20,      0),
(1, "平平无奇",  15,  1,   1,   1,   1,   1,   1,   10,   1,   1,    0,    20,      0),
(1, "平平无奇",  16,  1,   1,   1,   1,   1,   1,   10,   1,   1,    0,    20,      0),
(1, "平平无奇",  17,  1,   1,   1,   1,   1,   1,   10,   1,   1,    0,    20,      0),
(1, "平平无奇",  18,  1,   1,   1,   1,   1,   1,   10,   1,   1,    0,    20,      0),
(2, "勇猛无畏",  1,   2,   0,   0,   0,   0,   0,   0,    0,   0,    0,    0,       0),
(3, "刚烈霸道",  1,   2,   0,   0,   0,   0,   0,   0,    0,   0,    0,    10,      0),
(4, "激进冒险",  1,   2,   0,   0,   0,   0,   0,   0,    0,   0,    0,   -10,      0),
(5, "嗜血好战",  1,   1,   0,   0,   0,   0,   0,   0,    0,   1,    0,    10,      0),
(6, "冷静沉着",  1,   1,   0,   0,   0,   0,   0,   0,    0,   0,    0,    10,      0),
(6, "冷静沉着",  2,   1,   0,   0,   0,   0,   0,   0,    0,   0,    0,    10,      1),
(7, "深谋远虑",  1,   0,   1,   0,   1,   0,   0,   0,    0,   0,    0,   -10,      0),
(8, "随机应变",  1,   0,   1,   1,   0,   0,   0,   0,    0,   0,    0,     0,      1),
(9, "博学多才", 1,   0,   1,   1,   1,   0,   0,   0,    0,   0,    0,   -10,      0),
(10, "正直守诺",  1,   0,   0,   1,   0,   1,   0,   1,    1,   0,    0,     5,      0),
(11, "忠诚可靠", 1,   0,   0,   0,   0,   1,   0,   1,    0,   0,    0,     5,      0),
(12, "威严庄重", 1,   0,   0,   1,   0,   0,   0,   0,    0,   0,    0,     0,      0),
(13, "治军严明", 1,   0,   0,   1,   1,   0,   0,   0,    0,   0,    0,     0,      0);


